Ran Plan for dir: `bruno-athaide-product-test/poc-custom-metadata` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Read complete after 1s [id=1756224635]
data.configcat_environments.staging_environment: Reading...
data.configcat_environments.prod_environment: Reading...
data.configcat_segments.beta_users_segment: Reading...
data.configcat_environments.forno_environment: Reading...
data.configcat_segments.beta_users_segment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756224635]
data.configcat_environments.staging_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756224635]
data.configcat_environments.prod_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756224635]
data.configcat_environments.forno_environment: Read complete after 1s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756224635]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "POC Custom Metadata"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "POC Custom Metadata"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

  # configcat_setting.my_first_ff will be created
+ resource "configcat_setting" "my_first_ff" {
      + config_id    = (known after apply)
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MyFirstFF"
      + name         = "My First Feature Flag"
      + order        = 0
      + setting_type = "boolean"
    }

  # configcat_setting_value_v2.my_first_ff_value_forno will be created
+ resource "configcat_setting_value_v2" "my_first_ff_value_forno" {
      + environment_id  = "08ddc62c-1047-4871-8ffa-78230983a9d9"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = jsonencode(
            {
              + active      = true
              + expiry_date = "2024-12-31"
              + owner       = "qa-team"
              + priority    = "high"
            }
        )
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + value           = {
          + bool_value = false
        }
    }

  # configcat_setting_value_v2.my_first_ff_value_prod will be created
+ resource "configcat_setting_value_v2" "my_first_ff_value_prod" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = jsonencode(
            {
              + active      = true
              + expiry_date = "2024-12-31"
              + owner       = "qa-team"
              + priority    = "high"
            }
        )
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + value           = {
          + bool_value = false
        }
    }

  # configcat_setting_value_v2.my_first_ff_value_staging will be created
+ resource "configcat_setting_value_v2" "my_first_ff_value_staging" {
      + environment_id = "08ddc62c-15af-41a7-8157-8c8e34b9750e"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ config_name = "POC Custom Metadata"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-custom-metadata
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-custom-metadata%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-custom-metadata
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```